# 6
# Пользователь вводит номер буквы в алфавите. Определить, какая это буква

character = int(input("Введите номер символа: \n >>> "))
chr_result = chr(character)
print(chr_result)
